include/fedex/sample/Ground/Domestic/ProcessTagRequest.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/ship/v8">
<SOAP-ENV:Body>
<ProcessTagRequest>
<WebAuthenticationDetail>
<UserCredential>
<Key></Key>
<Password>
</Password>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber></AccountNumber>
<MeterNumber>7018124</MeterNumber>
</ClientDetail>
<TransactionDetail>
<CustomerTransactionId>TC01_USUS_GroundCallTag_FG_SEND_POS</CustomerTransactionId>
</TransactionDetail>
<Version>
<ServiceId>ship</ServiceId>
<Major>8</Major>
<Intermediate>0</Intermediate>
<Minor>0</Minor>
</Version>
<RequestedShipment>
<ShipTimestamp>2010-03-17T09:30:47-05:00</ShipTimestamp>
<DropoffType>REGULAR_PICKUP</DropoffType>
<ServiceType>FEDEX_GROUND</ServiceType>
<PackagingType>YOUR_PACKAGING</PackagingType>
<TotalWeight>
<Units>LB</Units>
<Value>149.0</Value>
</TotalWeight>
<TotalInsuredValue>
<Currency>USD</Currency>
<Amount>100.00</Amount>
</TotalInsuredValue>
<Shipper>
<Contact>
<PersonName>SHIPPER</PersonName>
<CompanyName>SYNTEL</CompanyName>
<PhoneNumber>9922184679</PhoneNumber>
</Contact>
<Address>
<StreetLines>SYNTEL1</StreetLines>
<City>Memphis</City>
<StateOrProvinceCode>TN</StateOrProvinceCode>
<PostalCode>38110</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</Shipper>
<Recipient>
<Contact>
<PersonName>RECIPIENT</PersonName>
<CompanyName>KCORP</CompanyName>
<PhoneNumber>9412491533</PhoneNumber>
</Contact>
<Address>
<StreetLines>1SYNTEL</StreetLines>
<City>Memphis</City>
<StateOrProvinceCode>TN</StateOrProvinceCode>
<PostalCode>38110</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</Recipient>
<ShippingChargesPayment>
<PaymentType>SENDER</PaymentType>
<Payor>
<AccountNumber></AccountNumber>
<CountryCode>US</CountryCode>
</Payor>
</ShippingChargesPayment>
<SpecialServicesRequested>
<SpecialServiceTypes>RETURN_SHIPMENT</SpecialServiceTypes>
<ReturnShipmentDetail>
<ReturnType>FEDEX_TAG</ReturnType>
</ReturnShipmentDetail>
</SpecialServicesRequested>
<PickupDetail>
<ReadyDateTime>2010-03-17T10:30:47-05:00</ReadyDateTime>
<LatestPickupDateTime>2010-03-17T15:30:47-05:00</LatestPickupDateTime>
<CourierInstructions>HandleWithCare</CourierInstructions>
</PickupDetail>
<LabelSpecification>
<LabelFormatType>COMMON2D</LabelFormatType>
<ImageType>DPL</ImageType>
<LabelStockType>PAPER_4X6</LabelStockType>
<LabelPrintingOrientation>BOTTOM_EDGE_OF_TEXT_FIRST</LabelPrintingOrientation>
</LabelSpecification>
<RateRequestTypes>LIST</RateRequestTypes>
<PackageCount>1</PackageCount>
<PackageDetail>PACKAGE_GROUPS</PackageDetail>
<RequestedPackageLineItems>
<SequenceNumber>1</SequenceNumber>
<InsuredValue>
<Currency>USD</Currency>
<Amount>100.00</Amount>
</InsuredValue>
<Weight>
<Units>LB</Units>
<Value>50.00</Value>
</Weight>
<ItemDescription>String</ItemDescription>
</RequestedPackageLineItems>
</RequestedShipment>
</ProcessTagRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>